geeksville/touchy-pad/v2/sdkconfig.defaults
# SPDX-License-Identifier: Apache-2.0
# Common defaults for touchy-pad v2 (all boards).
#
# Per-board overrides (flash size, PSRAM mode, partition CSV, pixel clock,
# etc.) live in boards/<board>/sdkconfig.defaults and are layered on top of
# this file by the top-level CMakeLists.txt.

# ----- Target -----
CONFIG_IDF_TARGET="esp32s3"

# ----- CPU / FreeRTOS -----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ----- Console / UART -----
# By default ESP32-S3 routes the console through the built-in USB
# Serial/JTAG controller, which holds the USB D+/D- pins and prevents
# TinyUSB from enumerating as a HID device. Switch the console to UART0
# so the OTG peripheral is free for HID.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=n

# ----- USB (TinyUSB device, HID mouse) -----
CONFIG_TINYUSB_DEBUG_LEVEL=0
CONFIG_TINYUSB_HID_COUNT=1

# ----- LVGL -----
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_30=y

# ----- Log -----
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ----- Custom partition table (filename supplied per-board) -----
CONFIG_PARTITION_TABLE_CUSTOM=y
